In [1]:
import pandas as pd

In [2]:
s = pd.Series([10,20,30], index=['a','b','c'])

In [3]:
s.head()

a    10
b    20
c    30
dtype: int64

In [4]:
df = pd.DataFrame({
    'name':['Lucy','Silver'],
    'age':[18,23],
    'hobies':["reading","music"]})

In [5]:
df

     name  age   hobies
0    Lucy   18  reading
1  Silver   23    music

In [6]:
pb = pd.read_csv('QVI_purchase_behaviour.csv')
td = pd.read_excel("QVI_transaction_data.xlsx")

In [7]:
pb.head()

   LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0            1000   YOUNG SINGLES/COUPLES          Premium
1            1002   YOUNG SINGLES/COUPLES       Mainstream
2            1003          YOUNG FAMILIES           Budget
3            1004   OLDER SINGLES/COUPLES       Mainstream
4            1005  MIDAGE SINGLES/COUPLES       Mainstream

In [10]:
td.head(15)

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
0,43390,1,1000,1,5,Natural Chip Compny SeaSalt175g,2,6.0
1,43599,1,1307,348,66,CCs Nacho Cheese 175g,3,6.3
2,43605,1,1343,383,61,Smiths Crinkle Cut Chips Chicken 170g,2,2.9
3,43329,2,2373,974,69,Smiths Chip Thinly S/Cream&Onion 175g,5,15.0
4,43330,2,2426,1038,108,Kettle Tortilla ChpsHny&Jlpno Chili 150g,3,13.8
5,43604,4,4074,2982,57,Old El Paso Salsa Dip Tomato Mild 300g,1,5.1
6,43601,4,4149,3333,16,Smiths Crinkle Chips Salt & Vinegar 330g,1,5.7
7,43601,4,4196,3539,24,Grain Waves Sweet Chilli 210g,1,3.6
8,43332,5,5026,4525,42,Doritos Corn Chip Mexican Jalapeno 150g,1,3.9
9,43330,7,7150,6900,52,Grain Waves Sour Cream&Chives 210G,2,7.2
10,43602,7,7215,7176,16,Smiths Crinkle Chips Salt & Vinegar 330g,1,5.7
11,43332,8,8294,8221,114,Kettle Sensations Siracha Lime 150g,5,23.0
12,43603,9,9208,8634,15,Twisties Cheese 270g,2,9.2
13,43329,13,13213,12447,92,WW Crinkle Cut Chicken 175g,1,1.7
14,43600,19,19272,16686,44,Thins Chips Light& Tangy 175g,1,3.3

In [9]:
pb.tail()

       LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
72632         2370651  MIDAGE SINGLES/COUPLES       Mainstream
72633         2370701          YOUNG FAMILIES       Mainstream
72634         2370751          YOUNG FAMILIES          Premium
72635         2370961          OLDER FAMILIES           Budget
72636         2373711   YOUNG SINGLES/COUPLES       Mainstream

In [11]:
td.tail()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
264831,43533,272,272319,270088,89,Kettle Sweet Chilli And Sour Cream 175g,2,10.8
264832,43325,272,272358,270154,74,Tostitos Splash Of Lime 175g,1,4.4
264833,43410,272,272379,270187,51,Doritos Mexicana 170g,2,8.8
264834,43461,272,272379,270188,42,Doritos Corn Chip Mexican Jalapeno 150g,2,7.8
264835,43365,272,272380,270189,74,Tostitos Splash Of Lime 175g,2,8.8

In [12]:
pb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72637 entries, 0 to 72636
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LYLTY_CARD_NBR    72637 non-null  int64
 1   LIFESTAGE         72637 non-null  object
 2   PREMIUM_CUSTOMER  72637 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [13]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   DATE            264836 non-null  int64
 1   STORE_NBR       264836 non-null  int64
 2   LYLTY_CARD_NBR  264836 non-null  int64
 3   TXN_ID          264836 non-null  int64
 4   PROD_NBR        264836 non-null  int64
 5   PROD_NAME       264836 non-null  object
 6   PROD_QTY        264836 non-null  int64
 7   TOT_SALES       264836 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 16.2+ MB

In [14]:
pb.describe()

       LYLTY_CARD_NBR
count    7.263700e+04
mean     1.361859e+05
std      8.989293e+04
min      1.000000e+03
25%      6.620200e+04
50%      1.340400e+05
75%      2.033750e+05
max      2.373711e+06

In [15]:
td.describe()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_QTY,TOT_SALES
count,264836.000000,264836.00000,2.648360e+05,2.648360e+05,264836.000000,264836.000000,264836.000000
mean,43464.036260,135.08011,1.355495e+05,1.351583e+05,56.583157,1.907309,7.304200
std,105.389282,76.78418,8.057998e+04,7.813303e+04,32.826638,0.643654,3.083226
min,43282.000000,1.00000,1.000000e+03,1.000000e+00,1.000000,1.000000,1.500000
25%,43373.000000,70.00000,7.002100e+04,6.760150e+04,28.000000,2.000000,5.400000
50%,43464.000000,130.00000,1.303575e+05,1.351375e+05,56.000000,2.000000,7.400000
75%,43555.000000,203.00000,2.030942e+05,2.027012e+05,85.000000,2.000000,9.200000
max,43646.000000,272.00000,2.373711e+06,2.415841e+06,114.000000,200.000000,650.000000

In [16]:
td.shape

(264836, 8)

In [17]:
td.columns

Index(['DATE', 'STORE_NBR', 'LYLTY_CARD_NBR', 'TXN_ID', 'PROD_NBR',
       'PROD_NAME', 'PROD_QTY', 'TOT_SALES'],
      dtype='object')

In [18]:
td.dtypes

DATE                int64
STORE_NBR           int64
LYLTY_CARD_NBR      int64
TXN_ID              int64
PROD_NBR            int64
PROD_NAME          object
PROD_QTY            int64
TOT_SALES         float64
dtype: object

In [19]:
td.index

RangeIndex(start=0, stop=264836, step=1)

In [20]:
td[['TXN_ID','STORE_NBR']]

        TXN_ID  STORE_NBR
0            1          1
1          348          1
2          383          1
3          974          2
4         1038          2
...        ...        ...
264831  270088        272
264832  270154        272
264833  270187        272
264834  270188        272
264835  270189        272

[264836 rows x 2 columns]

In [12]:
df.loc[row_label,col_label]
df.iloc[row_position,col_position]

NameError: name 'row_label' is not defined

In [ ]:
pb.isnull()

       LYLTY_CARD_NBR  LIFESTAGE  PREMIUM_CUSTOMER
0               False      False             False
1               False      False             False
2               False      False             False
3               False      False             False
4               False      False             False
...               ...        ...               ...
72632           False      False             False
72633           False      False             False
72634           False      False             False
72635           False      False             False
72636           False      False             False

[72637 rows x 3 columns]

In [ ]:
pb.dropna()

       LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0                1000   YOUNG SINGLES/COUPLES          Premium
1                1002   YOUNG SINGLES/COUPLES       Mainstream
2                1003          YOUNG FAMILIES           Budget
3                1004   OLDER SINGLES/COUPLES       Mainstream
4                1005  MIDAGE SINGLES/COUPLES       Mainstream
...               ...                     ...              ...
72632         2370651  MIDAGE SINGLES/COUPLES       Mainstream
72633         2370701          YOUNG FAMILIES       Mainstream
72634         2370751          YOUNG FAMILIES          Premium
72635         2370961          OLDER FAMILIES           Budget
72636         2373711   YOUNG SINGLES/COUPLES       Mainstream

[72637 rows x 3 columns]

In [ ]:
df.fillna(df.mean, df.mode, df.median)

In [ ]:
pb.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
72632    False
72633    False
72634    False
72635    False
72636    False
Length: 72637, dtype: bool

In [ ]:
pb.drop_duplicates()

In [ ]:
pb.rename(columns={"LYLTY_CARD_NBR":'Loayality_card_id'}, inplace="True")

In [ ]:
pb.head()

   Loayality_card_id               LIFESTAGE PREMIUM_CUSTOMER
0               1000   YOUNG SINGLES/COUPLES          Premium
1               1002   YOUNG SINGLES/COUPLES       Mainstream
2               1003          YOUNG FAMILIES           Budget
3               1004   OLDER SINGLES/COUPLES       Mainstream
4               1005  MIDAGE SINGLES/COUPLES       Mainstream

In [ ]:
pb['Loayality_card_id'].astype('float')

0           1000.0
1           1002.0
2           1003.0
3           1004.0
4           1005.0
           ...
72632    2370651.0
72633    2370701.0
72634    2370751.0
72635    2370961.0
72636    2373711.0
Name: Loayality_card_id, Length: 72637, dtype: float64

## Data manupulation

In [11]:
td.sort_values(['PROD_NAME','TOT_SALES'], ascending=[True,False],inplace=True)

In [ ]:
td.head()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
32820,43329,247,247052,248890,94,Burger Rings 220g,5,11.5
135400,43330,124,124181,127921,94,Burger Rings 220g,5,11.5
150492,43326,63,63011,59387,94,Burger Rings 220g,5,11.5
151144,43331,264,264065,262821,94,Burger Rings 220g,5,11.5
172101,43600,178,178006,177611,94,Burger Rings 220g,5,11.5

In [ ]:
def func():
    pass

In [ ]:
td['PROD_QTY'].apply(lambda x: x*2)

32820     10
135400    10
150492    10
151144    10
172101    10
          ..
262219     2
262388     2
262933     2
264429     2
264678     2
Name: PROD_QTY, Length: 264836, dtype: int64

In [ ]:
[expression for item in iterable]

In [ ]:
sq  = [n**2 for n in range(1,10)]

In [ ]:
sq

[1, 4, 9, 16, 25, 36, 49, 64, 81]

#  Adding & Modifying Columns

In [ ]:
df["SALES_PER_ITEM"] = df["TOT_SALES"] / df["PROD_QTY"]  # Create new column
df["DISCOUNT"] = 0.1                                     # Add fixed value column
df["PROD_NAME"] = df["PROD_NAME"].str.upper()             # Modify column values

# Grouping & Aggregation

In [ ]:
df.groupby("STORE_NBR")["TOT_SALES"].sum()                 # Total sales per store
df.groupby("STORE_NBR").agg({"TOT_SALES": "mean", "PROD_QTY": "sum"})
df.groupby(["STORE_NBR", "PROD_NAME"]).size()              # Count per gr

In [ ]:
df["DATE"] = pd.to_datetime(df["DATE"], origin="1899-12-30", unit="D")  # Excel date conversion

# Merging & Joining

In [ ]:
# Example merge with product details
prod_info = pd.DataFrame({
    "PROD_NBR": [94],
    "CATEGORY": ["Snacks"]
})
df = df.merge(prod_info, on="PROD_NBR", how="left")

# Pivot Tables

In [ ]:
pd.pivot_table(df, values="TOT_SALES", index="STORE_NBR", columns="PROD_NAME", aggfunc="sum")

# Exporting Data

In [ ]:
df.to_csv("sales_data.csv", index=False)
df.to_excel("sales_data.xlsx", index=False)